# Rebar End Type Enumeration

Source: https://www.revitapidocs.com/2026/86d64a32-9f4d-d9e8-7f18-5cb632e8c35d.htm

---

| Rebar End Type Enumeration |
| --- |

Describes what is added at the end of a Rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum RebarEndType
```

```
Public Enumeration RebarEndType
```

```
public enum class RebarEndType
```

```
type RebarEndType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Crank | 3 | A Crank is added to the end of the Rebar. |
| EndTreatment | 2 | An End Treatment is added to the end of the Rebar. |
| Hook | 1 | A Hook is added to the end of the Rebar. |
| None | 0 | There is nothing added to the end of the Rebar. |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace